package section5;

public class For {
	public static void main(String[] args) {
		/*
		 *  반복문 : 똑같은 명령을 반복하여 수행하도록 하는 제어문
		 *  for (초기화식 ; 조건식 ; 증감식){
		 *  	조건식이 true일 때 실행하는 코드	
		 *  }
		 */
		/*------------------------------------------------------*/

//		TITLE : 1부터 10까지 출력하는 반복문
//		for(int i = 1; i<=10 ; i++ ) {
//			System.out.println(i);
//		}
		
//		/*
//		 * 중요한점. 마지막 증감은 시켜서 i의 최종값은 11로 false임
//		 */
		
		
		/*------------------------------------------------------*/
		/*
		 * 예제 : 1부터 10 까지의 합 출력 (반복문을 사용해서)
		 * 
		 * 예상 출력
		 * 합 : 55
		 */
		
//		int sum = 0;
//		
//		for(int i = 1; i <=10; i++) {// for문 안에서 작성된 변수는 for 문 중괄호 안에서만 사용 가능함 ex : i
//			sum += i;
//		}
//		System.out.println("합 : "+sum);
		
		/*------------------------------------------------------*/
		/*
		 *  예제2 : 1부터 100까지 숫자 중 짝수의 합 출력
		 *  
		 *  예상 출력
		 *  합 : 2550
		 */
		
//		int sum = 0;
//		
//		for(int i = 1 ; i<=100; i++) {
//			
//			if(i%2 == 0) {
//				sum += i;
//			}
//		}
//		System.out.println("합 : "+sum);
		
		/*------------------------------------------------------*/

		/*
		 *  중첩 for 문 ( 이중 for 문)
		 *  for 문 안에 for 문
		 */
//		for (int i = 1; i <= 10; i++) {
//			for (int j = 1; j <=10; j++) {
//				System.out.println("i : "+i+", j : "+j);
//			}
//			System.out.println("===================");
//		}		
		
		/*------------------------------------------------------*/
//		
//		/*
//		 * 예제 : 구구단 2단부터 9단까지 출력
//		 * 
//		 * 예상 출력
//		 * 2 X 1 = 2	2 X 2 = 4	 2 X 3 = 6	... 2 X 9 = 18
//		 * 3
//		 * 4
//		 * 5...
//		 * 
//		 * 9 X 1 = 9 ... 							9 X 9 = 81
//		 */
//		for (int i = 2; i <= 9; i++) {
//			for (int j = 1; j <= 9; j++) {//중간에 계산이 있으면 괄호 쓰는게 가독성,확실성?에서 좋음
//				System.out.print(i+" X "+j+" = "+(i*j)+"	");
//			}
//			System.out.println("");
//		}
//		
		
		/*------------------------------------------------------*/
		/*
		 *  에제 : 별찍기
		 *  
		 *  예상 출력
		 *  *		i=0, j=0
		 *  **		i=1, j=0, 1
		 *  ***		i=2, j=0, 1, 2
		 *  ****	i=3, j=0, 1, 2, 3
		 *  *****	i=4, j=0, 1, 2, 3, 4
		 *  
		 */
//		for (int i=0; i<5; i++) {
//			for (int j=0; j<=i; j++) {
//				System.out.print('*');
//			}
//			System.out.println("");
//		}
		

		
	}
}